In [7]:
import pandas as pd ; import numpy as np

In [8]:
w=pd.Series(["caner",np.nan,"ayşe","fatma"])
w

0    caner
1      NaN
2     ayşe
3    fatma
dtype: object

In [9]:
w.isnull()
#eksik veriyi sorgulama

0    False
1     True
2    False
3    False
dtype: bool

In [10]:
w.notnull()
#eksik olmayan veriyi sorgulama

0     True
1    False
2     True
3     True
dtype: bool

In [11]:
w[3]=None
#eksik veri atama

In [12]:
w.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [13]:
#eksik veriyi kaldırma

w.dropna()

0    caner
2     ayşe
dtype: object

In [14]:
w[w.notnull()]

0    caner
2     ayşe
dtype: object

In [15]:
from numpy import nan as NA

In [16]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [17]:
df.dropna()
#eksik veri olan "!satırlar!" kaldırılır.

     0    1    2
0  1.0  2.0  3.0

In [18]:
df.dropna(axis=0,how="all")
#tüm değerleri eksik veri olan satır kaldırılır.

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [19]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [20]:
df[1]=NA

In [21]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [22]:
df.dropna(axis=1, how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [23]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [24]:
df.dropna(thresh=1)
#en az ... değere sahip olan sütunları ekrana yazar.

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [25]:
df.dropna(how="all", axis=1)

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [26]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [27]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [28]:
df.fillna({0:7,1:9,2:14})

     0    1     2
0  1.0  9.0   3.0
1  4.0  9.0   5.0
2  7.0  9.0  14.0

In [29]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [30]:
df.fillna(9,inplace=True)
df

     0    1    2
0  1.0  9.0  3.0
1  4.0  9.0  5.0
2  9.0  9.0  9.0

In [31]:
df

     0    1    2
0  1.0  9.0  3.0
1  4.0  9.0  5.0
2  9.0  9.0  9.0

In [32]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [33]:
df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [34]:
df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [38]:
veri=pd.Series([1,0,NA,8])
veri

0    1.0
1    0.0
2    NaN
3    8.0
dtype: float64

In [39]:
veri.mean()
#verilerin değerlerinin ortalaması
# eksik veri olan indeks hesaplanırken dahil edilmez.

3.0

In [40]:
veri.fillna(veri.mean())

0    1.0
1    0.0
2    3.0
3    8.0
dtype: float64